## ===================================================
## 対象とする系、シミュレーションボックスについてのコード
## 系のエネルギーなどの観測コード
# ====================================================

# ----------------------------------------------------

## 縦横長1の系について、周期境界条件を考慮した距離を返す
def periodic_distance(x1, y1, x2, y2):
    rx = min((x1-x2)**2, (1-abs(x1-x2))**2)
    ry = min((y1-y2)**2, (1-abs(y1-y2))**2)
    return (rx + ry)**0.5

def periodic_coordinate(x1, y1):
    if x1 > 1:
        x1 -= 1.0
    elif x1 < 0:
        x1 += 1.0
    if y1 > 1:
        y1 -= 1.0
    elif y1 < 0:
        y1 += 1.0
    return x1, y1
# ----------------------------------------------------
